layer {
  name: "color"
  type: "Python"
  top: "color"
  top: "hha"
  top: "label"
  python_param {
    module: "nyud_layers"
    layer: "NYUDSegDataLayer"
    param_str: "{\'tops\': [\'color\', \'hha\', \'label\'], \'seed\': 1337, \'nyud_dir\': \'../data/nyud\', \'split\': \'trainval\'}"
  }
}
layer {
  name: "conv1_1color"
  type: "Convolution"
  bottom: "color"
  top: "conv1_1color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 100
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu1_1color"
  type: "ReLU"
  bottom: "conv1_1color"
  top: "conv1_1color"
}
layer {
  name: "conv1_2color"
  type: "Convolution"
  bottom: "conv1_1color"
  top: "conv1_2color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu1_2color"
  type: "ReLU"
  bottom: "conv1_2color"
  top: "conv1_2color"
}
layer {
  name: "pool1color"
  type: "Pooling"
  bottom: "conv1_2color"
  top: "pool1color"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1color"
  type: "Convolution"
  bottom: "pool1color"
  top: "conv2_1color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu2_1color"
  type: "ReLU"
  bottom: "conv2_1color"
  top: "conv2_1color"
}
layer {
  name: "conv2_2color"
  type: "Convolution"
  bottom: "conv2_1color"
  top: "conv2_2color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu2_2color"
  type: "ReLU"
  bottom: "conv2_2color"
  top: "conv2_2color"
}
layer {
  name: "pool2color"
  type: "Pooling"
  bottom: "conv2_2color"
  top: "pool2color"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1color"
  type: "Convolution"
  bottom: "pool2color"
  top: "conv3_1color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3_1color"
  type: "ReLU"
  bottom: "conv3_1color"
  top: "conv3_1color"
}
layer {
  name: "conv3_2color"
  type: "Convolution"
  bottom: "conv3_1color"
  top: "conv3_2color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3_2color"
  type: "ReLU"
  bottom: "conv3_2color"
  top: "conv3_2color"
}
layer {
  name: "conv3_3color"
  type: "Convolution"
  bottom: "conv3_2color"
  top: "conv3_3color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3_3color"
  type: "ReLU"
  bottom: "conv3_3color"
  top: "conv3_3color"
}
layer {
  name: "pool3color"
  type: "Pooling"
  bottom: "conv3_3color"
  top: "pool3color"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1color"
  type: "Convolution"
  bottom: "pool3color"
  top: "conv4_1color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu4_1color"
  type: "ReLU"
  bottom: "conv4_1color"
  top: "conv4_1color"
}
layer {
  name: "conv4_2color"
  type: "Convolution"
  bottom: "conv4_1color"
  top: "conv4_2color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu4_2color"
  type: "ReLU"
  bottom: "conv4_2color"
  top: "conv4_2color"
}
layer {
  name: "conv4_3color"
  type: "Convolution"
  bottom: "conv4_2color"
  top: "conv4_3color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu4_3color"
  type: "ReLU"
  bottom: "conv4_3color"
  top: "conv4_3color"
}
layer {
  name: "pool4color"
  type: "Pooling"
  bottom: "conv4_3color"
  top: "pool4color"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1color"
  type: "Convolution"
  bottom: "pool4color"
  top: "conv5_1color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu5_1color"
  type: "ReLU"
  bottom: "conv5_1color"
  top: "conv5_1color"
}
layer {
  name: "conv5_2color"
  type: "Convolution"
  bottom: "conv5_1color"
  top: "conv5_2color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu5_2color"
  type: "ReLU"
  bottom: "conv5_2color"
  top: "conv5_2color"
}
layer {
  name: "conv5_3color"
  type: "Convolution"
  bottom: "conv5_2color"
  top: "conv5_3color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu5_3color"
  type: "ReLU"
  bottom: "conv5_3color"
  top: "conv5_3color"
}
layer {
  name: "pool5color"
  type: "Pooling"
  bottom: "conv5_3color"
  top: "pool5color"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "fc6color"
  type: "Convolution"
  bottom: "pool5color"
  top: "fc6color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 4096
    pad: 0
    kernel_size: 7
    stride: 1
  }
}
layer {
  name: "relu6color"
  type: "ReLU"
  bottom: "fc6color"
  top: "fc6color"
}
layer {
  name: "drop6color"
  type: "Dropout"
  bottom: "fc6color"
  top: "fc6color"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7color"
  type: "Convolution"
  bottom: "fc6color"
  top: "fc7color"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 4096
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "relu7color"
  type: "ReLU"
  bottom: "fc7color"
  top: "fc7color"
}
layer {
  name: "drop7color"
  type: "Dropout"
  bottom: "fc7color"
  top: "fc7color"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "score_frcolor"
  type: "Convolution"
  bottom: "fc7color"
  top: "score_frcolor"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 40
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "conv1_1hha"
  type: "Convolution"
  bottom: "hha"
  top: "conv1_1hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 100
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu1_1hha"
  type: "ReLU"
  bottom: "conv1_1hha"
  top: "conv1_1hha"
}
layer {
  name: "conv1_2hha"
  type: "Convolution"
  bottom: "conv1_1hha"
  top: "conv1_2hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu1_2hha"
  type: "ReLU"
  bottom: "conv1_2hha"
  top: "conv1_2hha"
}
layer {
  name: "pool1hha"
  type: "Pooling"
  bottom: "conv1_2hha"
  top: "pool1hha"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1hha"
  type: "Convolution"
  bottom: "pool1hha"
  top: "conv2_1hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu2_1hha"
  type: "ReLU"
  bottom: "conv2_1hha"
  top: "conv2_1hha"
}
layer {
  name: "conv2_2hha"
  type: "Convolution"
  bottom: "conv2_1hha"
  top: "conv2_2hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu2_2hha"
  type: "ReLU"
  bottom: "conv2_2hha"
  top: "conv2_2hha"
}
layer {
  name: "pool2hha"
  type: "Pooling"
  bottom: "conv2_2hha"
  top: "pool2hha"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1hha"
  type: "Convolution"
  bottom: "pool2hha"
  top: "conv3_1hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3_1hha"
  type: "ReLU"
  bottom: "conv3_1hha"
  top: "conv3_1hha"
}
layer {
  name: "conv3_2hha"
  type: "Convolution"
  bottom: "conv3_1hha"
  top: "conv3_2hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3_2hha"
  type: "ReLU"
  bottom: "conv3_2hha"
  top: "conv3_2hha"
}
layer {
  name: "conv3_3hha"
  type: "Convolution"
  bottom: "conv3_2hha"
  top: "conv3_3hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu3_3hha"
  type: "ReLU"
  bottom: "conv3_3hha"
  top: "conv3_3hha"
}
layer {
  name: "pool3hha"
  type: "Pooling"
  bottom: "conv3_3hha"
  top: "pool3hha"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1hha"
  type: "Convolution"
  bottom: "pool3hha"
  top: "conv4_1hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu4_1hha"
  type: "ReLU"
  bottom: "conv4_1hha"
  top: "conv4_1hha"
}
layer {
  name: "conv4_2hha"
  type: "Convolution"
  bottom: "conv4_1hha"
  top: "conv4_2hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu4_2hha"
  type: "ReLU"
  bottom: "conv4_2hha"
  top: "conv4_2hha"
}
layer {
  name: "conv4_3hha"
  type: "Convolution"
  bottom: "conv4_2hha"
  top: "conv4_3hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu4_3hha"
  type: "ReLU"
  bottom: "conv4_3hha"
  top: "conv4_3hha"
}
layer {
  name: "pool4hha"
  type: "Pooling"
  bottom: "conv4_3hha"
  top: "pool4hha"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1hha"
  type: "Convolution"
  bottom: "pool4hha"
  top: "conv5_1hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu5_1hha"
  type: "ReLU"
  bottom: "conv5_1hha"
  top: "conv5_1hha"
}
layer {
  name: "conv5_2hha"
  type: "Convolution"
  bottom: "conv5_1hha"
  top: "conv5_2hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu5_2hha"
  type: "ReLU"
  bottom: "conv5_2hha"
  top: "conv5_2hha"
}
layer {
  name: "conv5_3hha"
  type: "Convolution"
  bottom: "conv5_2hha"
  top: "conv5_3hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "relu5_3hha"
  type: "ReLU"
  bottom: "conv5_3hha"
  top: "conv5_3hha"
}
layer {
  name: "pool5hha"
  type: "Pooling"
  bottom: "conv5_3hha"
  top: "pool5hha"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "fc6hha"
  type: "Convolution"
  bottom: "pool5hha"
  top: "fc6hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 4096
    pad: 0
    kernel_size: 7
    stride: 1
  }
}
layer {
  name: "relu6hha"
  type: "ReLU"
  bottom: "fc6hha"
  top: "fc6hha"
}
layer {
  name: "drop6hha"
  type: "Dropout"
  bottom: "fc6hha"
  top: "fc6hha"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7hha"
  type: "Convolution"
  bottom: "fc6hha"
  top: "fc7hha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 4096
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "relu7hha"
  type: "ReLU"
  bottom: "fc7hha"
  top: "fc7hha"
}
layer {
  name: "drop7hha"
  type: "Dropout"
  bottom: "fc7hha"
  top: "fc7hha"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "score_frhha"
  type: "Convolution"
  bottom: "fc7hha"
  top: "score_frhha"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 40
    pad: 0
    kernel_size: 1
  }
}
layer {
  name: "score_fused"
  type: "Eltwise"
  bottom: "score_frcolor"
  bottom: "score_frhha"
  top: "score_fused"
  eltwise_param {
    operation: SUM
    coeff: 0.5
    coeff: 0.5
  }
}
layer {
  name: "upscore"
  type: "Deconvolution"
  bottom: "score_fused"
  top: "upscore"
  param {
    lr_mult: 0
  }
  convolution_param {
    num_output: 40
    bias_term: false
    kernel_size: 64
    stride: 32
  }
}
layer {
  name: "score"
  type: "Crop"
  bottom: "upscore"
  bottom: "color"
  top: "score"
  crop_param {
    axis: 2
    offset: 19
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "score"
  bottom: "label"
  top: "loss"
  loss_param {
    ignore_label: 255
    normalize: false
  }
}
